module.exports.MESSAGES = {
  USER_NOT_FOUND: 'Запрашиваемый пользователь не найден',
  BAD_USER_DATA: 'Некорректные данные пользователя',
  BAD_AVATAR_LINK: 'Некорректная ссылка на аватар',
  CARD_NOT_FOUND: 'Запрашиваемая карточка не найдена',
  BAD_CARD_DATA: 'Некорректные данные карточки',
  ROUTE_NOT_FOUND: 'Адрес не найден',
  AUTH_FAIL: 'Неправильное имя пользователя или пароль',
  AUTH_NEEDED: 'Требуется авторизация',
  TOKEN_FAIL: 'Токен недействителен',
  INTERNAL: 'На сервере произошла ошибка',
  USER_EXISTS: 'Пользователь с таким e-mail уже существует',
};
